app/controllers/movies_controller.rb

SELECT DISTINCT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? AND (rating = 'G','R','PG-13','PG') LIMIT 1  [["id", 1]]
---
  def index
    @all_ratings = Movie.uniq.pluck(:rating)

    session[:ratings] = @all_ratings unless (params["commit"] == "Refresh" && (session[:ratings] = params["ratings"].keys rescue nil))
    session[:Sort] = params["Sort"] unless (params["Sort"] == nil)


    query = {}
    query[:conditions] = ["rating IN (?)", session[:ratings]] unless (session[:ratings] == nil)
    query[:order] = "#{session[:Sort]} ASC" unless (session[:Sort] == nil)
    @movies = Movie.find(:all, query)